app/views/outgoings/index.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	  <td><%= number_to_currency(outgoing.amount, :unit => "zł", :format => "%n %u") %></td>
	  <td><%= Category.find(outgoing.category_id).name %></td>

SELECT SUM("outgoings"."amount") AS sum_amount, "name" AS name FROM "outgoings" INNER JOIN "categories" ON "categories"."id" = "outgoings"."category_id" GROUP BY "name"
---

<%= pie_chart Outgoing.joins(:category).group(:name).sum(:amount),suffix: " zł", thousands: ",", messages: {empty: "Nie ma wpisów"}, download: {filename: "wykres"}, title: "Podział wydatków na kategorie" %>