app/views/outgoings/show.html.erb

  <strong>Kategoria</strong>
  <%= Category.find(@outgoing.category_id).name %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]