app/views/incomes/index.html.erb

	  <td><%= number_to_currency(income.amount, :unit => "zł", :format => "%n %u") %></td>
	  <td><%= Category.find(income.category_id).name %></td>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]


<%= pie_chart Income.joins(:category).group(:name).sum(:amount),suffix: " zł", thousands: ",", messages: {empty: "Nie ma wpisów"}, download: {filename: "wykres"}, title: "Podział przychodów na kategorie" %>
---
SELECT SUM("incomes"."amount") AS sum_amount, "name" AS name FROM "incomes" INNER JOIN "categories" ON "categories"."id" = "incomes"."category_id" GROUP BY "name"