app/views/incomes/show.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  <strong>Kategoria</strong>
  <%= Category.find(@income.category_id).name %>