app/controllers/categories_controller.rb

  def edit
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
	@category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Praca"], ["created_at", "2020-05-17 13:52:03.280838"], ["updated_at", "2020-05-17 13:52:03.280838"]]

  def destroy
	@category = Category.find(params[:id])
	@category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]