app/controllers/incomes_controller.rb

SELECT "incomes".* FROM "incomes" ORDER BY category_id desc
---
  def index
	@incomes = Income.order(sort_column + " " + sort_direction)

SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
	@income = Income.find(params[:id])

SELECT "categories".* FROM "categories"
---
  def new
    @income = Income.new
	@categories = Category.all.map { |c| [c.name, c.id]}

SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def edit
    @income = Income.find(params[:id])
	@categories = Category.all.map { |c| [c.name, c.id]}

SELECT "categories".* FROM "categories"
INSERT INTO "incomes" ("title", "text", "amount", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "cos tam"], ["text", "jakis opis"], ["amount", 4613.0], ["created_at", "2020-05-06 09:36:48.716557"], ["updated_at", "2020-05-06 09:36:48.716557"], ["category_id", 4]]
---
  def create
	@income = Income.new(income_params)
	@categories = Category.all.map { |c| [c.name, c.id]}

    if @income.save

SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "incomes" SET "category_id" = ?, "updated_at" = ? WHERE "incomes"."id" = ?  [["category_id", 5], ["updated_at", "2020-06-06 10:23:40.924113"], ["id", 3]]
---
  def update
    @income = Income.find(params[:id])

    if @income.update(income_params)

SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "incomes" WHERE "incomes"."id" = ?  [["id", 3]]
---
  def destroy
	@income = Income.find(params[:id])
	@income.destroy