app/controllers/outgoings_controller.rb

def index
	@outgoings = Outgoing.order(sort_column + " " + sort_direction)
---
SELECT "outgoings".* FROM "outgoings" ORDER BY category_id desc

  def show
	@outgoing = Outgoing.find(params[:id])
---
SELECT "outgoings".* FROM "outgoings" WHERE "outgoings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def new
    @outgoing = Outgoing.new
	@categories = Category.all.map{|c| [ c.name, c.id ] }
---
SELECT "categories".* FROM "categories"

  def edit
    @outgoing = Outgoing.find(params[:id])
	@categories = Category.all.map{|c| [ c.name, c.id ] }
---
SELECT "outgoings".* FROM "outgoings" WHERE "outgoings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"

  def create
	@outgoing = Outgoing.new(outgoing_params)
	@categories = Category.all.map{|c| [ c.name, c.id ] }

    if @outgoing.save
---
SELECT "categories".* FROM "categories"
INSERT INTO "outgoings" ("title", "text", "amount", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ASasd"], ["text", "asdasdasdasd"], ["amount", -5465.0], ["created_at", "2020-06-06 10:35:37.897512"], ["updated_at", "2020-06-06 10:35:37.897512"], ["category_id", 4]]

  def update
    @outgoing = Outgoing.find(params[:id])

    if @outgoing.update(outgoing_params)
---
SELECT "outgoings".* FROM "outgoings" WHERE "outgoings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "outgoings" SET "category_id" = ?, "updated_at" = ? WHERE "outgoings"."id" = ?  [["category_id", 5], ["updated_at", "2020-06-06 10:35:47.531028"], ["id", 1]]

  def destroy
	@outgoing = Outgoing.find(params[:id])
	@outgoing.destroy
---
SELECT "outgoings".* FROM "outgoings" WHERE "outgoings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "outgoings" WHERE "outgoings"."id" = ?  [["id", 2]]